app/controllers/movements_controller.rb

SELECT "rovers".* FROM "rovers"
---
  def start
    rovers = Rover.all