app/controllers/plateaus_controller.rb

  def create
    Plateau.create!(plateau_params)
---
INSERT INTO "plateaus" ("width", "height", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["width", 12], ["height", 12], ["created_at", "2023-10-10 17:36:15.926950"], ["updated_at", "2023-10-10 17:36:15.926950"]]