app/controllers/rovers_controller.rb

INSERT INTO "rovers" ("x_coordinate", "y_coordinate", "direction", "movements", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["x_coordinate", 2], ["y_coordinate", 3], ["direction", "N"], ["movements", "LRLR"], ["created_at", "2023-10-10 17:39:11.254949"], ["updated_at", "2023-10-10 17:39:11.254949"]]
---
  def create
    @rover = Rover.new(rover_params)
    if @rover.save